[{"text": "\\begin{equation}\nU_\\mathrm{inc} = \\sum_n^\\infty a_n \\psi_n^{(\\mathrm{inc})},\n\\label{exp1}\n\\end{equation}", "type": "latex", "itemtype": "equation", "prevtext": "\\begin{document}\n\n\\noindent\n\\textbf{Preprint of:}\\\\\nT. A. Nieminen, V. L. Y. Loke,\nA. M. Bra\\'{n}czyk,\nN. R. Heckenberg and\nH. Rubinsztein-Dunlop\\\\\n``Towards efficient modelling of optical micromanipulation\\\\\nof complex structures''\\\\\npp. 442--446 in\n\\textit{PIERS 2006 Cambridge Proceedings},\nThe Electromagnetics Academy, Cambridge, MA (2006)\n\n\n\\hrulefill\n\n\\begin{center}\n\n\\Large\n\\textbf{Towards efficient modelling of optical micromanipulation\\\\\nof complex structures}\n\n\\normalsize\nT. A. Nieminen, V. L. Y. Loke,\nA. M. Bra\\'{n}czyk,\nN. R. Heckenberg and\nH. Rubinsztein-Dunlop\n\n\\textit{The University of Queensland,\nBrisbane, Australia}\n\n\\texttt{timo@physics.uq.edu.au}\n\n\\end{center}\n\n\\begin{abstract}\nComputational methods for electromagnetic and light\nscattering can be used for the calculation of optical\nforces and torques. Since typical particles that are\noptically trapped or manipulated are on the order of the\nwavelength in size, approximate methods such as geometric\noptics or Rayleigh scattering are inapplicable, and solution\nor either the Maxwell equations or the vector Helmholtz equation\nmust be resorted to. Traditionally, such solutions were only\nfeasible for the simplest geometries; modern computational\npower enable the rapid solution of more general---but still\nsimple---geometries such as axisymmetric, homogeneous, and\nisotropic scatterers. However, optically-driven micromachines\nnecessarily require more complex geometries, and their\ncomputational modelling thus remains in the realm of challenging\ncomputational problems. We review our progress towards efficient\ncomputational modelling of optical tweezers and micromanipulation,\nincluding the trapping and manipulation of complex structures\nsuch as optical micromachines. In particular,\nwe consider the exploitation of symmetry in the modelling\nof such devices.\n\\end{abstract}\n\n\\section{Introduction}\n\nOptical tweezers have seen deployment in a wide range of applications\nin biology, soft materials, microassembly, and other fields.\nAs well as being used\nfor the trapping and manipulation of a wide range of natural and artificial\nobjects, optically trapped probes are used to measure forces on the order\nof piconewtons. Compared with this diverse range of experimental applications,\ntheory and accurate computational modelling of optical tweezers has received\nmuch less attention and has remained relatively undeveloped, especially for\nnon-spherical particles and non-Gaussian beams. This is unfortunate,\nespecially when we consider the growing\nfields of controlled rotation of complex microparticles---prototype\noptically-driven micromachines---and fully three-dimensional\nmanipulation using complex optical fields, where\nthe application of theory and modelling provide insight into the\nphysics, and allow engineering and optimisation.\n\nSince optical forces and torques result\nfrom the transfer of momentum and angular momentum from the trapping\nbeam to the particle via scattering, the theory and computational\nmodelling of optical tweezers is, in essence, the theory and computational\nmodelling of the scattering of light or electromagnetic radiation.\nSince typical particles that are\noptically trapped or manipulated are on the order of the\nwavelength in size, approximate methods such as geometric\noptics or Rayleigh scattering are inapplicable, and solution\nor either the Maxwell equations or the vector Helmholtz equation\nmust be resorted to. As scattering by particles in this size\nrange is of interest in many fields, a wide variety of analytical\nand computational methods have been developed. Thus, there is\na solid foundation on which to develop computational modelling\nof optical micromanipulation.\n\nThere are, however, complications that prevent simple direct application of\ntypical light-scattering codes. The first, but not necessarily the\nmost important, is that optical tweezers\nmakes use of a highly focussed laser beam, while most existing scattering\ncodes assume plane wave illumination. Perhaps more fundamental is the\nneed for a large number of repeated calculations to characterise an\noptical trap---even for an axisymmetric (but nonspherical) particle trapped\nin a circularly polarised Gaussian beam, we already have four degrees\nof freedom. Clearly, this places strong demands on computational\nefficiency.\n\nDue to this requirement for repeated calculation of scattering by\nthe same particle, we employ the \\textit{T}-matrix\nmethod~\\cite{waterman1971,mishchenko2004b}.\nBelow, we outline the employment of the \\textit{T}-matrix method\nfor the calculation of optical forces and torques. While most\nimplementations of the \\textit{T}-matrix method are\nrestricted to simple geometries, this is not a limitation\ninherent in the method; fundamentally, the \\textit{T}-matrix\nmethod is a \\emph{description} of the scattering properties of\na particle, not a method of calculating the scattering properties.\nTherefore, in principle, any method of calculating scattering\ncan be used to obtain the \\textit{T}-matrix for a scatterer.\nWe discuss such ``hybrid'' methods, where a computational method\nnot usually associated with the \\textit{T}-matrix method is\nused to calculate the \\textit{T}-matrix of a scatterer, and hence\nthe optical force and torque.\n\nA further important consideration is that optical micromachines,\nwhile complex, are likely to possess a high degree of symmetry; this\ncan be exploited to reduce computation times by orders of magnitude.\nWe demonstrate the effectiveness of this approach by modelling\nthe optical trapping and rotation of a cube. The two principal\nsymmetries of such shapes---mirror symmetry and discrete rotational\nsymmetry about the normal to the mirror symmetry plane---are\nexactly the symmetries that typify the ideal optically-driven rotor.\n\n\n\\section{\\textit{T}-matrix formalism for optical force and torque}\n\nThe \\textit{T}-matrix method in wave scattering involves writing the\nrelationship between the wave incident upon a scatterer, expanded in terms of\na sufficiently complete basis set of functions $\\psi_n^{(\\mathrm{inc})}$,\nwhere $n$ is a mode index labelling the functions, each of which is a\nsolution of the Helmholtz equation,\n", "nexttext": "\nwhere $a_n$ are the expansion coefficients for the incident wave,\nand the scattered wave, also expanded in terms of a basis set\n$\\psi_k^{(\\mathrm{scat})}$,\n", "file": "physics_0607231.tex", "index": 1, "pos": 6169, "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"U_{\\mathrm{inc}}=\\sum_{n}^{\\infty}a_{n}\\psi_{n}^{(\\mathrm{inc})},\" display=\"block\"><mrow><mrow><msub><mi>U</mi><mi>inc</mi></msub><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>n</mi><mi mathvariant=\"normal\">∞</mi></munderover><mrow><msub><mi>a</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>ψ</mi><mi>n</mi><mrow><mo stretchy=\"false\">(</mo><mi>inc</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow></mrow><mo>,</mo></mrow></math>"}, {"text": "\\begin{equation}\nU_\\mathrm{scat} = \\sum_k^\\infty p_k \\psi_k^{(\\mathrm{scat})},\n\\label{exp2}\n\\end{equation}", "type": "latex", "itemtype": "equation", "prevtext": "\nwhere $a_n$ are the expansion coefficients for the incident wave,\nand the scattered wave, also expanded in terms of a basis set\n$\\psi_k^{(\\mathrm{scat})}$,\n", "nexttext": "\nwhere $p_k$ are the expansion coefficients for the scattered wave,\nis written as a simple matrix equation\n", "file": "physics_0607231.tex", "index": 3, "pos": 6430, "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"U_{\\mathrm{scat}}=\\sum_{k}^{\\infty}p_{k}\\psi_{k}^{(\\mathrm{scat})},\" display=\"block\"><mrow><mrow><msub><mi>U</mi><mi>scat</mi></msub><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>k</mi><mi mathvariant=\"normal\">∞</mi></munderover><mrow><msub><mi>p</mi><mi>k</mi></msub><mo>⁢</mo><msubsup><mi>ψ</mi><mi>k</mi><mrow><mo stretchy=\"false\">(</mo><mi>scat</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow></mrow><mo>,</mo></mrow></math>"}, {"text": "\\begin{equation}\np_k = \\sum_n^\\infty T_{kn} a_n\n\\end{equation}", "type": "latex", "itemtype": "equation", "prevtext": "\nwhere $p_k$ are the expansion coefficients for the scattered wave,\nis written as a simple matrix equation\n", "nexttext": "\nor,  in more concise notation,\n", "file": "physics_0607231.tex", "index": 5, "pos": 6643, "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"p_{k}=\\sum_{n}^{\\infty}T_{kn}a_{n}\" display=\"block\"><mrow><msub><mi>p</mi><mi>k</mi></msub><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>n</mi><mi mathvariant=\"normal\">∞</mi></munderover><mrow><msub><mi>T</mi><mrow><mi>k</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>⁢</mo><msub><mi>a</mi><mi>n</mi></msub></mrow></mrow></mrow></math>"}, {"text": "\\begin{equation}\n\\mathbf{P} = \\mathbf{T} \\mathbf{A}\n\\end{equation}", "type": "latex", "itemtype": "equation", "prevtext": "\nor,  in more concise notation,\n", "nexttext": "\nwhere $T_{kn}$ are the elements of the \\textit{T}-matrix. The\n\\textit{T}-matrix formalism is a Hilbert basis description of\nscattering. The \\textit{T}-matrix depends only on the properties of the\nparticle---its composition,  size,\nshape, and orientation---and the wavelength, and is otherwise\nindependent of the incident field.\n\nThis means\nthat for any particular particle, the \\textit{T}-matrix only needs to be\ncalculated once, and can then be used for repeated calculations.\nThis is the key point that makes this an attractive method for modelling\noptical tweezers, providing a\nsignificant advantage over many other methods of calculating scattering where\nthe entire calculation needs to be repeated.\n\nThe natural choice of basis functions when describing scattering\nby a compact particle is to use vector spherical wavefunctions\n(VSWFs)~\\cite{waterman1971}.\nThe optical force and torque are given by sums of products of the modal\namplitudes~\\cite{farsund1996,crichton2000,nieminen2004d}.\n\nNotably, neither how the VSWF expansion of the incident field nor how\nthe \\textit{T}-matrix can be calculated has entered the above description\nof scattering.\nA variety of methods exist for the\nformer~\\cite{nieminen2003a,nieminen2004d}, and the latter task is generally\nthe more challenging computationally.\n\nMost implementations of the \\textit{T}-matrix method use the extended\nboundary condition method (EBCM), also called the null field method, to\ncalculate the \\textit{T}-matrix. This is so widespread that the\n\\textit{T}-matrix method and the EBCM are sometimes considered to be\ninseparable, and the terms are sometimes used interchangeably.\nHowever, from the description above, it is clear that the \\textit{T}-matrix\nformalism is independent of the actual method used to calculate the\n\\textit{T}-matrix~\\cite{kahnert2003b,nieminen2003b}.\n\nA number of alternative methods have been used for the calculation of\n\\textit{T}-matrices.\nNotably, such ``hybrid'' methods, for example the discrete dipole\napproximation (DDA) method used by\nMackowski~\\cite{mackowski2002} can be used for the calculation of\n\\textit{T}-matrices for particles of arbitrary shape, internal structure,\nand electromagnetic properties. Complex internal structure will generally\nrequire a discretisation of the internal volume of the particle, rather\nthan a method based on surface discretisation. We are working on\nboth finite-difference frequency-domain (FDFD) and DDA\nbased hybrid \\textit{T}-matrix solvers.\n\n\\section{Optical torque and symmetry}\n\nThe \\textit{T}-matrix elements are strongly dependent on the symmetry\nof the scatterer~\\cite{waterman1971}. We can deduce the principal features\nfrom Floquet's theorem, relating solutions to differential equations to\nthe periodicity of their boundary conditions.\n\nIf we have a scatterer with $n$th-order rotational symmetry about the\n$z$-axis, an incident mode of azimuthal index $m$ couples to scattered\nmodes with azimuthal indices $m, m\\pm n, m\\pm 2n, m\\pm 3n$ and so on. For\nscatterers that are mirror-symmetric, upward and downward coupling must be\nequal, in the sense that, for example, a mirror-symmetric scatterer of\n2nd order rotational symmetry (such as a long rod), {T}-matrix elements\ncoupling from $m = 1$ modes to $m = -1$ modes will have the same magnitudes\nas the elements coupling from $m = -1$ to $m = 1$ modes. For chiral\nscatterers, these \\textit{T}-matrix elements will, in general, be different.\n\nThis directly affects the optical torque; the vector spherical wavefunctions\nare eigenfunctions of the angular momentum operators $J^2$ and $J_z$.\nEssentially, the radial mode index $n$ gives the magnitude of the\nangular momentum flux, while the azimuthal mode index $m$ gives\nthe $z$-component of the angular momentum flux. Therefore, the coupling\nbetween orders of different $m$ describes the generation of optical\ntorques about the beam axis.\n\nFor the case of a rotationally symmetric scatterer, this means that there\nis no coupling between modes with differing angular momenta about\nthe $z$-axis\\cite{waterman1971,mishchenko1991,nieminen2004a}.\nTherefore, it is not possible to exert optical torque on such scatterers\nexcept by absorption (or gain)---since the incoming and outgoing\nangular momenta\nper photon are the same, the only optical torque can result from a change\nin the number of photons. In general, the use of absorption for the\ntransfer of optical torque is impractical, due to excessive heating.\nTherefore, a departure from rotational symmetry is required. This\ncan be either at the macroscopic (the shape of the particle) or\nmicroscopic (optical properties of the particle) level.\n\nBirefringent and elongated or flattened particles are simple\nexamples of introducing such asymmetry; notably, such particles were\nthe first to be controllably optically rotated through means other\nthan absorption, for example by Beth in the first measurements\nof optical torque~\\cite{beth1936}. Particles with these properties\nhave also been rotated in optical traps~\\cite{friese1998nature,bonin2002,bayoudh2003,bishop2003}. As such particles can still\nbe axisymmetric about one axis, rapid calculation of optical\nforces and torques is still possible~\\cite{bayoudh2003,bishop2003}\n\nMore complex particles have also been fabricated and\nrotated~\\cite{galajda2001,luo2000,ukita2002}, but in these cases,\nthere are few results from computational modelling~\\cite{collett2003}.\n\nAs such structures typically possess discrete rotational symmetry,\nthe restrictions on coupling between azimuthal orders can be used\nto reduce the number of \\textit{T}-matrix elements that need to\nbe calculated. This can greatly reduce the time required. This\nis also the case for the hybrid methods described above. For a scatterer\nwith $p$th-order discrete rotational symmetry, it is only necessary\nto perform calculations for a $1/p$ portion of the entire structure.\nIf, in addition, there is mirror symmetry about the $xy$ plane, the\nparity of the VSWFs will be preserved. Therefore, an odd-$n$ TE mode\nwill only couple to odd-$n$ TE modes and even-$n$ TM modes. This halves\nnumber of non-zero \\textit{T}-matrix elements, and halves the portion\nof the structure that needs to be modelled.\n\n\\section{Example: optical trapping of a cube}\n\nA simple example illustrating both the relationship between optical\ntorque and symmetry, and the exploitation of particle symmetry for\nmore efficient calculation of optical forces and torques,\nis the optical trapping of a cube. The cube embodies both\nof the symmetries---mirror symmetry and discrete rotational\nsymmetry about the normal to the mirror symmetry plane---that\ntypify the ideal optically-driven rotor.\n\nAs the cube has 4th-order rotational symmetry, and mirror symmetry\nwith respect to the $Cy$ plane, each incident modes only couples to\napproximately $1/8$ the number of significant scattered modes.\nAlthough the column-by-column calculation of the \\textit{T}-matrix\nstill requires the same number of least-squared solutions, each of\nthis is of a smaller system of equations, and much faster.\nFor example, the two wavelengths wide cube used in our example below\nrequired 30 minutes for the calculation of the \\textit{T}-matrix\non a 32 bit single-processor 3\\,GHz microcomputer, as compared with\n30 hours for an object of the same size lacking the cube's symmetries.\nOnly one octant of the cube was explicitly included in the\ncalculation.\n\nIf figure 1, we show the optical force and torque exerted on a\ncube with relative refractive index of $1.19 = 1.59/1.34$, and faces\n$2\\lambda$ across, where $\\lambda$ is the wavelength in the surrounding\nmedium. Once the \\textit{T}-matrix is calculated, to calculate the\noptical force and torque at a particular position requires less than\n1 second (unless the point is far from the beam focus, in which case,\nup to 10 seconds or so can be needed).\n\n\\begin{figure}[!h]\n(a) \\hspace{0.47\\columnwidth} (b) \\\\\n\\centerline{\\includegraphics[width=0.48\\columnwidth,draft=false]{cube1.eps}\n\\includegraphics[width=0.48\\columnwidth,draft=false]{cube2.eps}} \\\\\n(c)  \\hspace{0.47\\columnwidth} (d) \\\\\n\\centerline{\\includegraphics[width=0.48\\columnwidth,draft=false]{cube3.eps}\n\\includegraphics[width=0.48\\columnwidth,draft=false]{cube4.eps}} \n\\caption{Optical force and torque on a dielectric cube. (a) shows the\naxial force as a function of position along the beam axis, showing that\nthe cube can be trapped. (b)--(d) show the dependence of the optical\ntorque on the beam convergence angle and the polarisation and orbital\nangular momentum. In (b), the beam is Gaussian (ie LG$_{00}$), while in\n(c) and (d), the beams are LG$_{01}$ and LG$_{02}$ respectively.\nThe solid lines are for plane polarised beams, while dotted and dashed\nlines are for circularly polarised beams with spin parallel to and\nantiparallel to the orbital angular momentum.}\n\\label{fig1}\n\\end{figure}\n\nIn figure 1(a), we see that cubic shapes can be stably trapped axially,\nwhile 1(b)--(d) show that optical torque can be generated by such\nstructures. The increased efficiency resulting from the use of \norbital angular momentum~\\cite{nieminen2004d} is clear.\n\n\\section{Conclusion}\n\nThe symmetry properties of a scatterer can be used to dramatically speed\nthe calculation of the scattering properties of a particle. If these\nare expressed in the form of the \\textit{T}-matrix, this enables rapid and\nefficient calculation of optical forces and torques. Since typical\noptically-driven microrotors possess discrete rotational symmetry, they are\nideal candidates for this method. In addition, mirror symmetry about\na plane can also be used to further reduce the computational burden.\nFinally, ``hybrid'' \\textit{T}-matrix methods can be used for particles\nwith geometries or internal structure making them unsuitable for\ntraditional methods of calculating \\textit{T}-matrices.\n\n\\begin{thebibliography}{99}\n\n\\bibitem{waterman1971}\nP.~C. Waterman, ``Symmetry, unitarity, and geometry in electromagnetic\n  scattering,'' {\\em Phys. Rev. D}, Vol.~3, 825--839, 1971.\n\n\\bibitem{mishchenko2004b}\nM.~I. Mishchenko, G.~Videen, V.~A. Babenko, N.~G. Khlebtsov, and T.~Wriedt,\n  ``{\\textit{T}}-matrix theory of electromagnetic scattering by particles and\n  its applications: a comprehensive reference database,'' {\\em J. Quant.\n  Spectrosc. Radiat. Transfer}, Vol.~88, 357--406, 2004.\n\n\\bibitem{farsund1996}\n{\\O}.~Farsund and B.~U. Felderhof, ``Force, torque, and absorbed energy for a\n  body of arbitrary shape and constitution in an electromagnetic radiation\n  field,'' {\\em Physica A}, Vol.~227, 108--130, 1996.\n\n\\bibitem{crichton2000}\nJ.~H. Crichton and P.~L. Marston, ``The measurable distinction between the spin\n  and orbital angular momenta of electromagnetic radiation,'' {\\em Elec.\n  J. Differential Equations}, Vol.~Conf.~04, 37--50, 2000.\n\n\\bibitem{nieminen2004d}\nT.~A. Nieminen, N.~R. Heckenberg, and H.~Rubinsztein-Dunlop, ``Computational\n  modelling of optical tweezers,'' {\\em Proc. SPIE}, Vol.~5514, 514--523,\n  2004.\n\n\\bibitem{nieminen2003a}\nT.~A. Nieminen, H.~Rubinsztein-Dunlop, and N.~R. Heckenberg, ``Multipole\n  expansion of strongly focussed laser beams,'' {\\em J. Quant. Spectrosc.\n  Radiat. Transfer}, Vol.~79--80, 1005--1017, 2003.\n\n\\bibitem{kahnert2003b}\nF.~M. Kahnert, ``Numerical methods in electromagnetic scattering theory,'' {\\em\n  J. Quant. Spectrosc. Radiat. Transfer}, Vol.~79--80, 775--824, 2003.\n\n\\bibitem{nieminen2003b}\nT.~A. Nieminen, H.~Rubinsztein-Dunlop, and N.~R. Heckenberg, ``Calculation of\n  the {\\textit{T}}-matrix: general considerations and application of the\n  point-matching method,'' {\\em J. Quant. Spectrosc. Radiat. Transfer},\n  Vol.~79-80, 1019--1029, 2003.\n\n\\bibitem{mackowski2002}\nD.~W. Mackowski, ``Discrete dipole moment method for calculation of the\n  {\\textit{T}} matrix for nonspherical particles,'' {\\em J. Opt. Soc. Am. A},\n  Vol.~19, 881--893, 2002.\n\n\\bibitem{mishchenko1991}\nM.~I. Mishchenko, ``Light scattering by randomly oriented axially symmetric\n  particles,'' {\\em J. Opt. Soc. Am. A}, Vol.~8,\n  871--882, 1991.\n\n\\bibitem{nieminen2004a}\nT.~A. Nieminen, ``Comment on ``{G}eometric absorption of electromagnetic\n  angular momentum'', {C}. {K}onz, {G}. {B}enford,'' {\\em Opt. Commun.},\n  Vol.~235, 227--229, 2004.\n\n\\bibitem{beth1936}\nR.~A. Beth, ``Mechanical detection and measurement of the angular momentum of\n  light,'' {\\em Physical Review}, Vol.~50, 115--125, 1936.\n\n\\bibitem{friese1998nature}\nM.~E.~J. Friese, T.~A. Nieminen, N.~R. Heckenberg, and H.~Rubinsztein-Dunlop,\n  ``Optical alignment and spinning of laser trapped microscopic particles,''\n  {\\em Nature}, Vol.~394, 348--350, 1998.\n\n\n\\bibitem{bonin2002}\nK.~D. Bonin, B.~Kourmanov, and T.~G. Walker, ``Light torque nanocontrol,\n  nanomotors and nanorockers,'' {\\em Opt. Express}, Vol.~10, 984--989,\n  2002.\n\n\\bibitem{bayoudh2003}\nS.~Bayoudh, T.~A. Nieminen, N.~R. Heckenberg, and H.~Rubinsztein-Dunlop,\n  ``Orientation of biological cells using plane polarised {G}aussian beam\n  optical tweezers,'' {\\em J. Mod. Opt.}, Vol.~50, No.~10,\n  1581--1590, 2003.\n\n\\bibitem{bishop2003}\nA.~I. Bishop, T.~A. Nieminen, N.~R. Heckenberg, and H.~Rubinsztein-Dunlop,\n  ``Optical application and measurement of torque on microparticles of\n  isotropic nonabsorbing material,'' {\\em Phys. Rev. A}, Vol.~68, 033802,\n  2003.\n\n\\bibitem{galajda2001}\nP.~Galajda and P.~Ormos, ``Complex micromachines produced and driven by\n  light,'' {\\em Appl. Phys. Lett.}, Vol.~78, 249--251, 2001.\n\n\\bibitem{luo2000}\nZ.-P. Luo, Y.-L. Sun, and K.-N. An, ``An optical spin micromotor,'' {\\em\n  Appl. Phys. Lett.}, Vol.~76, 1779--1781, 2000.\n\n\\bibitem{ukita2002}\nH.~Ukita and M.~Kanehira, ``A shuttlecock optical rotator\\textemdash its\n  design, fabrication and evaluation for a microfluidic mixer,'' {\\em IEEE J.\n  Select. Topics Quantum Electron.}, Vol.~8, 111--117, 2002.\n\n\\bibitem{collett2003}\nW.~L. Collett, C.~A. Ventrice, and S.~M. Mahajan, ``Electromagnetic wave\n  technique to determine radiation torque on micromachines driven by light,''\n  {\\em Appl. Phys. Lett.}, Vol.~82, 2730--2732, 2003.\n\n\\end{thebibliography}\n\n\n\n\\end{document}", "file": "physics_0607231.tex", "index": 7, "pos": 6737, "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{P}=\\mathbf{T}\\mathbf{A}\" display=\"block\"><mrow><mi>𝐏</mi><mo>=</mo><mi>𝐓𝐀</mi></mrow></math>"}]